OpenFoam_Shapes/Rectangle/design_points/design_point_1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            noSlip;
    }
    Bottom
    {
        type            noSlip;
    }
    Top
    {
        type            noSlip;
    }
    Inlet
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }
    Outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
